import { Container, SectionStyled } from 'components/helpers/styled';
import React from 'react';
import QuestionItem from './QuestionItem';

const FAQBlock = () => {
  return (
    <SectionStyled>
      <Container>
        <h2>FAQ</h2>
        <QuestionItem title="Чи потрібно підписувати контракт перед роботою?">
          Так, після обговорення плану роботи ми разом підписуємо контракт за
          допомогою цифрового підпису. Контракт регулює весь процес роботи,
          виплати, будь-які непередбачувані обставини та інші важливі частини
          проєкту. Даний документ захищає обидві сторони – як замовника, так і
          виконавця.
        </QuestionItem>
        <QuestionItem title="Як проводиться оплата?">
          Є два варіанти оплати: повна передплата та поетапна передплата. Повна
          передплата передбачає переказ всієї суми за проєкт одразу на початку
          співпраці. Поетапна передплата передбачає оплату частинами за кожен
          етап (або декілька). До кожної платіжної операції прикріплюється
          інвойс (чек) з інформацією про оплачену послугу або етап.
        </QuestionItem>
        <QuestionItem title="Чи можна повернути кошти після оплати?">
          Так, можна. Як це працює: в будь-якому випадку з суми повернення
          утримується 5% та комісія банку. Повертаються кошти лише за ті етапи
          проєкту, які не були розпочаті. Вся робота, яка була виконана та
          оплачена, надсилається замовнику. Етапи, які були розпочаті, завжди
          доводяться до кінця (за бажанням замовника).
        </QuestionItem>
        <QuestionItem title="Чи можна допрацювати вже наявний сайт?">
          Ні, лише створити сайт з нуля. Наявний сайт можна використати як
          приклад для дизайну, контенту та інш., проте це не передбачає
          зменшення вартості послуги.
        </QuestionItem>
        <QuestionItem title="Чи можна обрати тільки один етап, а не всю послугу?">
          Ні, можливе лише замовлення повноцінної послуги. В деяких випадках, за
          бажанням замовника та попереднім обговоренням, можливе виключення 1-2
          етапів з послуги. Вартість проєкту, який містить менше етапів роботи,
          зменшується.
        </QuestionItem>
      </Container>
    </SectionStyled>
  );
};

export default FAQBlock;
